; domain
(define (domain gripper-typed)
   (:requirements :typing)
   (:types room ball gripper)
   (:constants left right - gripper)
   (:predicates (DUMMY-FLAG)
        (at-robby ?r - room)
		(at ?b - ball ?r - room)
		(free ?g - gripper)
		(carry ?o - ball ?g - gripper))

   (:action dead-end-pick
       :parameters (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?room) (free ?gripper))
       :effect (and (DUMMY-FLAG)
            (carry ?obj ?gripper)
		    (not (at ?obj ?room))
		    (not (free ?gripper))))

   (:action move
       :parameters  (?from ?to - room)
       :precondition (at-robby ?from)
       :effect (and  (at-robby ?to)
		     (not (at-robby ?from))))



   (:action pick
       :parameters (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?room) (free ?gripper))
       :effect (and (carry ?obj ?gripper)
		    (not (at ?obj ?room)) 
		    (not (free ?gripper))))


   (:action drop
       :parameters  (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (carry ?obj ?gripper) (at-robby ?room))
       :effect (and (at ?obj ?room)
		    (free ?gripper)
		    (not (carry ?obj ?gripper)))))

; problem
(define (problem gripper-x-19)
   (:domain gripper-typed)
   (:objects rooma roomb - room
             DUMMY1 DUMMY2 DUMMY3 DUMMY4 DUMMY5 ball40 ball39 ball38 ball37 ball36 ball35 ball34 ball33 ball32
             ball31 ball30 ball29 ball28 ball27 ball26 ball25 ball24 ball23
             ball22 ball21 ball20 ball19 ball18 ball17 ball16 ball15 ball14
             ball13 ball12 ball11 ball10 ball9 ball8 ball7 ball6 ball5 ball4
             ball3 ball2 ball1 - ball)
   (:init (at-robby rooma)
          (free left)
          (free right)
          (at ball40 rooma)
          (at ball39 rooma)
          (at ball38 rooma)
          (at ball37 rooma)
          (at ball36 rooma)
          (at ball35 rooma)
          (at ball34 rooma)
          (at ball33 rooma)
          (at ball32 rooma)
          (at ball31 rooma)
          (at ball30 rooma)
          (at ball29 rooma)
          (at ball28 rooma)
          (at ball27 rooma)
          (at ball26 rooma)
          (at ball25 rooma)
          (at ball24 rooma)
          (at ball23 rooma)
          (at ball22 rooma)
          (at ball21 rooma)
          (at ball20 rooma)
          (at ball19 rooma)
          (at ball18 rooma)
          (at ball17 rooma)
          (at ball16 rooma)
          (at ball15 rooma)
          (at ball14 rooma)
          (at ball13 rooma)
          (at ball12 rooma)
          (at ball11 rooma)
          (at ball10 rooma)
          (at ball9 rooma)
          (at ball8 rooma)
          (at ball7 rooma)
          (at ball6 rooma)
          (at ball5 rooma)
          (at ball4 rooma)
          (at ball3 rooma)
          (at ball2 rooma)
          (at ball1 rooma))
   (:goal (and (at ball40 roomb)
               (at ball39 roomb)
               (at ball38 roomb)
               (at ball37 roomb)
               (at ball36 roomb)
               (at ball35 roomb)
               (at ball34 roomb)
               (at ball33 roomb)
               (at ball32 roomb)
               (at ball31 roomb)
               (at ball30 roomb)
               (at ball29 roomb)
               (at ball28 roomb)
               (at ball27 roomb)
               (at ball26 roomb)
               (at ball25 roomb)
               (at ball24 roomb)
               (at ball23 roomb)
               (at ball22 roomb)
               (at ball21 roomb)
               (at ball20 roomb)
               (at ball19 roomb)
               (at ball18 roomb)
               (at ball17 roomb)
               (at ball16 roomb)
               (at ball15 roomb)
               (at ball14 roomb)
               (at ball13 roomb)
               (at ball12 roomb)
               (at ball11 roomb)
               (at ball10 roomb)
               (at ball9 roomb)
               (at ball8 roomb)
               (at ball7 roomb)
               (at ball6 roomb)
               (at ball5 roomb)
               (at ball4 roomb)
               (at ball3 roomb)
               (at ball2 roomb)
               (at ball1 roomb))))

; plan
1. (dead-end-pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (dummy-flag) (carry ball1 left)
   goals met: 0 of 40
2. (dead-end-pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 0 of 40
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 40
4. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 1 of 40
5. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 2 of 40
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 40
7. (dead-end-pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 2 of 40
8. (dead-end-pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 2 of 40
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 40
10. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 3 of 40
11. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 4 of 40
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 4 of 40
13. (dead-end-pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 4 of 40
14. (dead-end-pick ball14 rooma right)
   deleted: (at ball14 rooma) (free right)
   added: (carry ball14 right)
   goals met: 4 of 40
15. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 40
16. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 5 of 40
17. (drop ball14 roomb right)
   deleted: (carry ball14 right)
   added: (at ball14 roomb) (free right)
   goals met: 6 of 40
18. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 40
19. (dead-end-pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 6 of 40
20. (dead-end-pick ball16 rooma right)
   deleted: (at ball16 rooma) (free right)
   added: (carry ball16 right)
   goals met: 6 of 40
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 40
22. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 7 of 40
23. (drop ball16 roomb right)
   deleted: (carry ball16 right)
   added: (at ball16 roomb) (free right)
   goals met: 8 of 40
24. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 40
25. (dead-end-pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 8 of 40
26. (dead-end-pick ball18 rooma right)
   deleted: (at ball18 rooma) (free right)
   added: (carry ball18 right)
   goals met: 8 of 40
27. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 40
28. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 9 of 40
29. (drop ball18 roomb right)
   deleted: (carry ball18 right)
   added: (at ball18 roomb) (free right)
   goals met: 10 of 40
30. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 40
31. (dead-end-pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 10 of 40
32. (dead-end-pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 10 of 40
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 40
34. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 11 of 40
35. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 12 of 40
36. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 40
37. (dead-end-pick ball20 rooma left)
   deleted: (at ball20 rooma) (free left)
   added: (carry ball20 left)
   goals met: 12 of 40
38. (dead-end-pick ball21 rooma right)
   deleted: (at ball21 rooma) (free right)
   added: (carry ball21 right)
   goals met: 12 of 40
39. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 40
40. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 13 of 40
41. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 14 of 40
42. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 40
43. (dead-end-pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 14 of 40
44. (dead-end-pick ball23 rooma right)
   deleted: (at ball23 rooma) (free right)
   added: (carry ball23 right)
   goals met: 14 of 40
45. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 40
46. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 15 of 40
47. (drop ball23 roomb right)
   deleted: (carry ball23 right)
   added: (at ball23 roomb) (free right)
   goals met: 16 of 40
48. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 16 of 40
49. (dead-end-pick ball24 rooma left)
   deleted: (at ball24 rooma) (free left)
   added: (carry ball24 left)
   goals met: 16 of 40
50. (dead-end-pick ball25 rooma right)
   deleted: (at ball25 rooma) (free right)
   added: (carry ball25 right)
   goals met: 16 of 40
51. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 40
52. (drop ball24 roomb left)
   deleted: (carry ball24 left)
   added: (at ball24 roomb) (free left)
   goals met: 17 of 40
53. (drop ball25 roomb right)
   deleted: (carry ball25 right)
   added: (at ball25 roomb) (free right)
   goals met: 18 of 40
54. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 18 of 40
55. (dead-end-pick ball26 rooma left)
   deleted: (at ball26 rooma) (free left)
   added: (carry ball26 left)
   goals met: 18 of 40
56. (dead-end-pick ball27 rooma right)
   deleted: (at ball27 rooma) (free right)
   added: (carry ball27 right)
   goals met: 18 of 40
57. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 18 of 40
58. (drop ball26 roomb left)
   deleted: (carry ball26 left)
   added: (at ball26 roomb) (free left)
   goals met: 19 of 40
59. (drop ball27 roomb right)
   deleted: (carry ball27 right)
   added: (at ball27 roomb) (free right)
   goals met: 20 of 40
60. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 40
61. (dead-end-pick ball28 rooma left)
   deleted: (at ball28 rooma) (free left)
   added: (carry ball28 left)
   goals met: 20 of 40
62. (dead-end-pick ball29 rooma right)
   deleted: (at ball29 rooma) (free right)
   added: (carry ball29 right)
   goals met: 20 of 40
63. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 40
64. (drop ball28 roomb left)
   deleted: (carry ball28 left)
   added: (at ball28 roomb) (free left)
   goals met: 21 of 40
65. (drop ball29 roomb right)
   deleted: (carry ball29 right)
   added: (at ball29 roomb) (free right)
   goals met: 22 of 40
66. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 40
67. (dead-end-pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 22 of 40
68. (dead-end-pick ball30 rooma right)
   deleted: (at ball30 rooma) (free right)
   added: (carry ball30 right)
   goals met: 22 of 40
69. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 40
70. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 23 of 40
71. (drop ball30 roomb right)
   deleted: (carry ball30 right)
   added: (at ball30 roomb) (free right)
   goals met: 24 of 40
72. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 40
73. (dead-end-pick ball31 rooma left)
   deleted: (at ball31 rooma) (free left)
   added: (carry ball31 left)
   goals met: 24 of 40
74. (dead-end-pick ball32 rooma right)
   deleted: (at ball32 rooma) (free right)
   added: (carry ball32 right)
   goals met: 24 of 40
75. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 40
76. (drop ball31 roomb left)
   deleted: (carry ball31 left)
   added: (at ball31 roomb) (free left)
   goals met: 25 of 40
77. (drop ball32 roomb right)
   deleted: (carry ball32 right)
   added: (at ball32 roomb) (free right)
   goals met: 26 of 40
78. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 40
79. (dead-end-pick ball33 rooma left)
   deleted: (at ball33 rooma) (free left)
   added: (carry ball33 left)
   goals met: 26 of 40
80. (dead-end-pick ball34 rooma right)
   deleted: (at ball34 rooma) (free right)
   added: (carry ball34 right)
   goals met: 26 of 40
81. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 40
82. (drop ball33 roomb left)
   deleted: (carry ball33 left)
   added: (at ball33 roomb) (free left)
   goals met: 27 of 40
83. (drop ball34 roomb right)
   deleted: (carry ball34 right)
   added: (at ball34 roomb) (free right)
   goals met: 28 of 40
84. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 40
85. (dead-end-pick ball35 rooma left)
   deleted: (at ball35 rooma) (free left)
   added: (carry ball35 left)
   goals met: 28 of 40
86. (dead-end-pick ball36 rooma right)
   deleted: (at ball36 rooma) (free right)
   added: (carry ball36 right)
   goals met: 28 of 40
87. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 40
88. (drop ball35 roomb left)
   deleted: (carry ball35 left)
   added: (at ball35 roomb) (free left)
   goals met: 29 of 40
89. (drop ball36 roomb right)
   deleted: (carry ball36 right)
   added: (at ball36 roomb) (free right)
   goals met: 30 of 40
90. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 40
91. (dead-end-pick ball37 rooma left)
   deleted: (at ball37 rooma) (free left)
   added: (carry ball37 left)
   goals met: 30 of 40
92. (dead-end-pick ball38 rooma right)
   deleted: (at ball38 rooma) (free right)
   added: (carry ball38 right)
   goals met: 30 of 40
93. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 40
94. (drop ball37 roomb left)
   deleted: (carry ball37 left)
   added: (at ball37 roomb) (free left)
   goals met: 31 of 40
95. (drop ball38 roomb right)
   deleted: (carry ball38 right)
   added: (at ball38 roomb) (free right)
   goals met: 32 of 40
96. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 40
97. (dead-end-pick ball39 rooma left)
   deleted: (at ball39 rooma) (free left)
   added: (carry ball39 left)
   goals met: 32 of 40
98. (dead-end-pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 32 of 40
99. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 40
100. (drop ball39 roomb left)
   deleted: (carry ball39 left)
   added: (at ball39 roomb) (free left)
   goals met: 33 of 40
101. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 34 of 40
102. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 40
103. (dead-end-pick ball40 rooma left)
   deleted: (at ball40 rooma) (free left)
   added: (carry ball40 left)
   goals met: 34 of 40
104. (dead-end-pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 34 of 40
105. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 40
106. (drop ball40 roomb left)
   deleted: (carry ball40 left)
   added: (at ball40 roomb) (free left)
   goals met: 35 of 40
107. (drop ball5 roomb right)
   deleted: (carry ball5 right)
   added: (at ball5 roomb) (free right)
   goals met: 36 of 40
108. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 36 of 40
109. (dead-end-pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 36 of 40
110. (dead-end-pick ball7 rooma right)
   deleted: (at ball7 rooma) (free right)
   added: (carry ball7 right)
   goals met: 36 of 40
111. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 36 of 40
112. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 37 of 40
113. (drop ball7 roomb right)
   deleted: (carry ball7 right)
   added: (at ball7 roomb) (free right)
   goals met: 38 of 40
114. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 38 of 40
115. (dead-end-pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 38 of 40
116. (dead-end-pick ball9 rooma right)
   deleted: (at ball9 rooma) (free right)
   added: (carry ball9 right)
   goals met: 38 of 40
117. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 38 of 40
118. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 39 of 40
119. (drop ball9 roomb right)
   deleted: (carry ball9 right)
   added: (at ball9 roomb) (free right)
   goals met: 40 of 40
